ProgessBase/Documents/ДС_ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ДС_ГрафикПлатежей</Name>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДС_ФактическиеПлатежи</xr:Item>
				<xr:Item>InformationRegister.ДС_ГрафикПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйЛизинговыйПлатеж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоРегулярногоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_Продлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДС_ВидыПлатежейМСФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CurrentBalanceOpening</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FinanceCost</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LeasePaymentProvided</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CurrentBalanceClosing</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ДС_ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДС_ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceOpening</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FinanceCost</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LeasePaymentProvided</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceClosing</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ВидыПлатежейМСФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ДС_ФактическиеПлатежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДС_ФактическиеПлатежи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LIBOR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceOpening</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FinanceCostПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FinanceCost</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LeasePaymentПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LeasePaymentActual</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceClosing</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceClosingST</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceClosingLT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>LeasePaymentActualRaspred</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ВидыПлатежейМСФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ДС_СтавкаLIBOR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДС_СтавкаLIBOR</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ПериодВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ДС_ВидыПлатежейМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДС_ВидыПлатежейМСФО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныйПлатеж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/ДС_ПериодВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДС_ПериодВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ДС_ГрафикПлатежей/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		Организация = ДанныеЗаполнения.Организация;
		Договор = ДанныеЗаполнения;
		Объект = ДанныеЗаполнения.ДС_ОбъектДоговора;
		ис_Продлен = ДанныеЗаполнения.ис_Продлен;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДС_ГрафикПлатежей.Записывать		= Истина;
	Движения.ДС_ФактическиеПлатежи.Записывать	= Истина;
	
	// is Зайцева нач 20140702 
	лДвиженияГрафикПлатежей = Движения.ДС_ГрафикПлатежей;
	лДвиженияГрафикПлатежей.ДополнительныеСвойства.Вставить("Договор", Договор);
	// is Зайцева кон 20140702
	
	/// Кунов О.В., 10.11.2014 - 
	Если ДополнительныеСвойства.Свойство("ЗагружаетсяИзОбработки") Тогда
		лДвиженияГрафикПлатежей.ДополнительныеСвойства.Вставить("ЗагружаетсяИзОбработки");
	КонецЕсли;
	///
	
	// is ЯннуровВФ нач 20140910 ЗР-0И-001397
	Если ис_Продлен Тогда 
		лСрокДоговора = Договор.ис_СрокПродления;
	Иначе
		лСрокДоговора = Договор.ДС_СрокДействияДоговора;
	КонецЕсли;
	// is ЯннуровВФ кон 20140910
	
	Для каждого Стр Из ГрафикПлатежей Цикл
		
		Движение				= Движения.ДС_ГрафикПлатежей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.ПериодПлатежа	= Стр.Период;
		Движение.Договор		= Договор;
		Движение.LeasePaymentProvided = - Стр.LeasePaymentProvided;
		
	// is ЯннуровВФ нач 20140815
	КонецЦикла;
	Движения.ДС_ГрафикПлатежей.Записать();
		
	Для каждого Стр Из ГрафикПлатежей Цикл
	// is ЯннуровВФ кон 20140815
		
		// is ЯннуровВФ нач 20140624 0И-001448
		//Если Договор.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.ЛизингОборудования Тогда
		// is ЯннуровВФ кон 20140624
		Если Стр.ВидПлатежа = Перечисления.ДС_ВидыПлатежейМСФО.ДополнительныйАванс Тогда
			
			Движение				= Движения.ДС_ФактическиеПлатежи.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Стр);
			Движение.Договор		= Договор;
			Движение.ПериодПлатежа	= Стр.Период;
			
			// is ЯннуровВФ нач 20140624 0И-001448
			//Движение.LIBOR = РегистрыСведений.ДС_СтавкаLIBOR.ПолучитьПоследнее(Стр.ДатаПлатежа, Новый Структура("Валюта, Периодичность", Договор.ВалютаВзаиморасчетов, Договор.ДС_ПериодВыплат)).Ставка;
			Если Договор.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.ЛизингОборудования Тогда
				Движение.LIBOR = РегистрыСведений.ДС_СтавкаLIBOR.ПолучитьПоследнее(Стр.ДатаПлатежа, Новый Структура("Валюта, Периодичность", Договор.ВалютаВзаиморасчетов, Договор.ДС_ПериодВыплат)).Ставка;
			КонецЕсли;
			// is ЯннуровВФ кон 20140624
			Движение.FinanceCost = Движение.CurrentBalanceOpening * (Договор.ДС_ФиксированнаяСтавка + Движение.LIBOR) / (?(Договор.ДС_ПериодВыплат = Перечисления.ДС_ПериодВыплат.Месяц, 12, 4) * 100);
			// is ЯннуровВФ нач 20140910 ЗР-0И-001397
			//Движение.LeasePaymentActual = (Движение.CurrentBalanceOpening * (Договор.ДС_ФиксированнаяСтавка + Движение.LIBOR)/(?(Договор.ДС_ПериодВыплат = Перечисления.ДС_ПериодВыплат.Месяц, 12, 4)*100))/(1 - Pow((1 + (Договор.ДС_ФиксированнаяСтавка + Движение.LIBOR)/(?(Договор.ДС_ПериодВыплат = Перечисления.ДС_ПериодВыплат.Месяц, 12, 4)*100)), -(Договор.ДС_СрокДействияДоговора - Движение.ПериодПлатежа + 1)));
			Движение.LeasePaymentActual = (Движение.CurrentBalanceOpening * (Договор.ДС_ФиксированнаяСтавка + Движение.LIBOR)/(?(Договор.ДС_ПериодВыплат = Перечисления.ДС_ПериодВыплат.Месяц, 12, 4)*100))/(1 - Pow((1 + (Договор.ДС_ФиксированнаяСтавка + Движение.LIBOR)/(?(Договор.ДС_ПериодВыплат = Перечисления.ДС_ПериодВыплат.Месяц, 12, 4)*100)), -(лСрокДоговора - Движение.ПериодПлатежа + 1)));
			// is ЯннуровВФ кон 20140910
			// is ЯннуровВФ нач 20140818
			//Движение.CurrentBalanceClosing = Движение.CurrentBalanceOpening + Движение.FinanceCost - Движение.LeasePaymentActual;
			// is ЯннуровВФ кон 20140818
			// is ЯннуровВФ нач 20140815
			Движение.FinanceCostПлан = Стр.FinanceCost;
			Движение.LeasePaymentПлан = -Стр.LeasePaymentProvided;
			Движение.CurrentBalanceClosingLT = ПолучитьCurrentBalanceClosingLT(Движение.ДатаПлатежа);
			Движение.CurrentBalanceClosingST = Движение.CurrentBalanceClosing - Движение.CurrentBalanceClosingLT;
			// is ЯннуровВФ кон 20140815

		ИначеЕсли Стр.ВидПлатежа = Перечисления.ДС_ВидыПлатежейМСФО.Предоплата Тогда
			
			Движение				= Движения.ДС_ФактическиеПлатежи.Добавить();
			Движение.Договор		= Договор;
			Движение.ПериодПлатежа	= Стр.Период;
			Движение.ВидПлатежа		= Стр.ВидПлатежа;
			Движение.ДатаПлатежа	= Стр.ДатаПлатежа;
			// is ЯннуровВФ нач 20140624 0И-001448
			//Движение.LIBOR = РегистрыСведений.ДС_СтавкаLIBOR.ПолучитьПоследнее(Стр.ДатаПлатежа, Новый Структура("Валюта, Периодичность", Договор.ВалютаВзаиморасчетов, Договор.ДС_ПериодВыплат)).Ставка;
			Если Договор.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.ЛизингОборудования Тогда
				Движение.LIBOR = РегистрыСведений.ДС_СтавкаLIBOR.ПолучитьПоследнее(Стр.ДатаПлатежа, Новый Структура("Валюта, Периодичность", Договор.ВалютаВзаиморасчетов, Договор.ДС_ПериодВыплат)).Ставка;
			КонецЕсли;
			// is ЯннуровВФ кон 20140624
            Движение.CurrentBalanceOpening = Стр.CurrentBalanceOpening;
			Движение.CurrentBalanceClosing = Стр.CurrentBalanceClosing;
			Движение.LeasePaymentActual = - Стр.LeasePaymentProvided;
			// is ЯннуровВФ нач 20140815
			Движение.FinanceCostПлан = Стр.FinanceCost;
			Движение.LeasePaymentПлан = -Стр.LeasePaymentProvided;
			Движение.CurrentBalanceClosingLT = ПолучитьCurrentBalanceClosingLT(Движение.ДатаПлатежа);
			Движение.CurrentBalanceClosingST = Движение.CurrentBalanceClosing - Движение.CurrentBalanceClosingLT;
			// is ЯннуровВФ кон 20140815
		
		КонецЕсли;	
		
	КонецЦикла;	
	
	
КонецПроцедуры


Функция ПолучитьCurrentBalanceClosingLT(ДатаПлатежа)
	лСумма = 0;
	
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДС_ГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
	|	ДС_ГрафикПлатежей.CurrentBalanceClosing
	|ИЗ
	|	РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
	|ГДЕ
	|	ДС_ГрафикПлатежей.Договор = &Договор
	|	И ДС_ГрафикПлатежей.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ДС_ВидыПлатежейМСФО.РегулярныйПлатеж)
	|	И ДС_ГрафикПлатежей.ДатаПлатежа <= &ДатаПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлатежа УБЫВ";
	лЗапрос.УстановитьПараметр("Договор", Договор);
	лЗапрос.УстановитьПараметр("ДатаПлатежа", КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаПлатежа),12)));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() Тогда 
		лСумма = лВыборка.CurrentBalanceClosing;
	КонецЕсли;
	
	Возврат лСумма;
КонецФункции
